In [2]:
import pandas as pd
import numpy as np

In [4]:
dict1 ={ "name":['ram','shyam','karam','shiv'],
        "marks":[99,98,95,99],
        "city":['rampur','shyamgadh','karambhoomi','kailash']
       }

In [5]:
df = pd.DataFrame(dict1)

In [6]:
df

    name  marks         city
0    ram     99       rampur
1  shyam     98    shyamgadh
2  karam     95  karambhoomi
3   shiv     99      kailash

In [7]:
df.to_csv('friends.csv')

In [8]:
df.to_csv('friends_1noindex.csv',index=False)

In [9]:
df.head(2)

    name  marks       city
0    ram     99     rampur
1  shyam     98  shyamgadh

In [10]:
df.tail(2)

    name  marks         city
2  karam     95  karambhoomi
3   shiv     99      kailash

In [11]:
df.describe()

           marks
count   4.000000
mean   97.750000
std     1.892969
min    95.000000
25%    97.250000
50%    98.500000
75%    99.000000
max    99.000000

In [12]:
myStudents = pd.read_csv('students.csv')

In [13]:
myStudents

   students  roll no  age  marks
0      aman        1   22     98
1  baalveer        2   19     95
2    cherry        3   21     96
3       dev        4   26     97
4   eklavya        5   20    100